Зарплата_и_Управление_Персоналом_демо/src/InformationRegisters/МатериальноОтветственныеЛица/МатериальноОтветственныеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МатериальноОтветственныеЛица</name>
  <resources>
    <name>ЗонаОтветственности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеАктуален</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Зарплата_и_Управление_Персоналом_демо/src/InformationRegisters/НастройкиКадровогоУчета/НастройкиКадровогоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиКадровогоУчета</name>
  <resources>
    <name>ИспользоватьРаботуНаНеполнуюСтавку</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьПереносОстатковОтпускаПриУвольненииПереводом</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьУникальностьТабельныхНомеров</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПравилоФормированияПредставленияЭлементовСправочникаСотрудники</name>
    <type>
      <types>EnumRef.ВариантыПравилФормированияПредставленияЭлементовСправочникаСотрудники</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьПечататьТ6ДляОтпусковПоБеременностиИРодам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтображатьИзмененияОплатыТрудаВЛичнойКарточке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВПоляхВводаСотрудниковУчитыватьИзмененияФамилии</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуетсяРаботаСКоронавирусом</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПолучательСтимулирующихВыплатФСС</name>
    <type>
      <types>EnumRef.ПолучательСтимулирующихВыплатФСС</types>
    </type>
  </resources>
  <resources>
    <name>ПриемНаРаботуБезПриказаОПриеме</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СоциальныеВыплатыОтдельнымКатегориямМедРаботников</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуютсяДанныеСотрудниковВнешнихИсточников</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьМатериальнуюОтветственностьСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
</mdclass:InformationRegister>

Зарплата_и_Управление_Персоналом_демо/src/InformationRegisters/МатериальноОтветственныеЛица/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	МатериальноОтветственныеЛица.МатериальноОтветственныеЛицаПередЗаписью(ЭтотОбъект, Отказ, Замещение);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если Не ПолучитьФункциональнуюОпцию("УчитыватьМатериальнуюОтветственностьСотрудников") Тогда
		
		// Настройка "УчитыватьМатериальнуюОтветственностьСотрудников" взводится автоматически при записи в регистр.
		// И при записи интерактивно и при записи обменом.
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КОЛИЧЕСТВО(*) КАК КоличествоЗаписей
			|ИЗ
			|	РегистрСведений.МатериальноОтветственныеЛица КАК МатериальноОтветственныеЛица
			|
			|ИМЕЮЩИЕ
			|	КОЛИЧЕСТВО(*) > 0";
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			
			НастройкиКадровогоУчета = РегистрыСведений.НастройкиКадровогоУчета.СоздатьНаборЗаписей();
			НастройкиКадровогоУчета.Прочитать();
			Если НастройкиКадровогоУчета.Количество() > 0 Тогда
				НастройкиКадровогоУчета[0].УчитыватьМатериальнуюОтветственностьСотрудников = Истина;
				НастройкиКадровогоУчета.ДополнительныеСвойства.Вставить("ПроверятьБизнесЛогикуПриЗаписи");
			Иначе
				НоваяЗапись = НастройкиКадровогоУчета.Добавить();
				НоваяЗапись.УчитыватьМатериальнуюОтветственностьСотрудников = Истина;
			КонецЕсли;
			
			НастройкиКадровогоУчета.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
